# After making changes to code or tables call org-babel-tangle (C-c C-v t).

#+PROPERTY: header-args:python  :eval nil

**** table-layout

Produce base layer from separate tap and hold tables.

#+NAME: table-layout
#+BEGIN_SRC python :var blank_val=blank :var alphas_table=colemakdh :var alias_table=aliases :var mods_l_table=mods-l :var mods_r_table=mods-r :var bottom_table=bottomrow :var top_table=toprow  :var hold_table=hold :var symbol_names_table=symbol-names :var mods_table=mods :var td_table=tapdance :var osmods_table=osmods :var nonkc_table=nonkc :var fun_table=functions :tangle no :results verbatim
from itertools import zip_longest
from collections import OrderedDict


def list_to_dict(lst):
    res = {}
    for i in lst:
        res[i[0]] = i[1]
    return res


width = 10
mods_dict = OrderedDict.fromkeys(mods_table[0])
osmods_dict = OrderedDict.fromkeys(osmods_table[0])
td_dict = OrderedDict.fromkeys(td_table[0])
top_dict = OrderedDict.fromkeys(top_table[0])
bottom_dict = OrderedDict.fromkeys(bottom_table[0])
fun_dict = OrderedDict.fromkeys(fun_table[0])
alias_dict = list_to_dict(alias_table)
blank_val = blank_val[0]


def keycode(key, hold, location):
    if key == "":
        code = "NO"
    if str(key) in symbol_names_dict:
        code = symbol_names_dict[str(key)]
    elif key in alias_dict:
        code = str(key)
    elif key in osmods_dict:
        code = "OSM(MOD_" + str(key[1::]) + ")"
    elif key in td_dict:
        code = "TD(" + str(key) + ")"
    elif key:
        code = str(key)
    else:
        code = "NO"
    if not str(code).startswith(nonkc_tuple) and code not in alias_dict:
        code = "KC_" + str(code)
    if hold in osmods_dict:
        code = "OSM(MOD_" + str(hold[1::]) + ")"
    elif hold in mods_dict:
        code = str(hold) + "_T(" + code + ")"
    elif hold in alias_dict or hold in fun_dict:
        code = hold
    elif hold != "" and hold != "U_NP" and hold != "RESET":
        code = "LT(" + str(hold) + ", " + code + ")"

    code = (str(code + ", ")).ljust(width)
    return code


nonkc_tuple = tuple(nonkc_table[0])
symbol_names_dict = {}
for symbol, name, shifted_symbol, shifted_name in symbol_names_table:
    symbol_names_dict[symbol] = name
    symbol_names_dict[shifted_symbol] = shifted_name

results = ""
for top in top_dict:
    results += keycode(top, "", "mod")

results = results.rstrip(" ") + "\n"

for lmod, tap_row, rmod, hold_row in zip_longest(
    mods_l_table, alphas_table, mods_r_table, hold_table, fillvalue=""
):
    for mod in lmod:
        results += keycode(str(mod), "", "mod")
    for tap, hold in zip(tap_row, hold_row):
        results += keycode(str(tap), hold, "alpha")
    for mod in rmod:
        results += keycode(str(mod), "", "rmod")
    results = results.rstrip(" ") + "\n"


i = 1
length = 16 - len(bottom_dict.items())

for bot in bottom_dict.keys():
    results += keycode(str(bot), "", "bottom")

for i in range(1, length):
    mod = "NO"
    results += (str(mod + ", ")).ljust(width)


results = results.rstrip("\n, ")
return results
#+END_SRC

#+RESULTS: table-layout
: GESC,     1,        2,        3,        4,        5,        6,        7,        8,        9,        NO,       MINS,     EQL,      BSPC,     GRV,
: TAB,      Q,        W,        F,        P,        B,        J,        L,        U,        Y,        SCLN,     LBRC,     RBRC,     BSLS,     DEL,
: ESC,      GUI_A,    ALT_R,    CTL_S,    SHFT_T,   G,        M,        SHFT_T,   CTL_E,    ALT_I,    GUI_O,    QUOT_TD,  ENT,      NO,       NO,
: MLSFT,    X,        C,        D,        MDIA_V,   Z,        K,        H,        COMM,     DOT,      SLSH,     MRSFT,    UP,       NO,       NO,
: CAPS,     LGUI,     LALT,     SPC_TD,   RALT,     RCTL,     FNM,      LEFT,     DOWN,     RIGHT,    NO,       NO,       NO,       NO,       NO






**** table-enums

Produce layer enums from layer names in hold table.

#+NAME: table-enums
#+BEGIN_SRC python :var layer_table=layers :var mods_table=mods :tangle no
mods_dict = dict.fromkeys(mods_table[0])
layers = [ ]
keycodes = [ ]
for layer_row in layer_table:
  for hold in layer_row:
    if hold not in mods_dict and isinstance(hold, str) and hold != '' and hold != 'U_NP' and hold != 'RESET' and hold not in layers:
      layers.append(hold)
      if hold == "_COLEMAK":
          hold = "_COLEMAK = SAFE_RANGE"
      keycodes.append(hold[1:])
results = 'enum tpeacock19_layers { ' + ', '.join(layers) + ' };'
results = results.rstrip(' ') + '\n\n'
results += 'enum tpeacock19_keycodes { ' + ', '.join(keycodes) + ' };'
return results
#+END_SRC

#+RESULTS: table-enums
: enum tpeacock19_layers { _COLEMAK, _QWERTY, _FNM, _NUM, _MDIA };
: 
: enum tpeacock19_keycodes { COLEMAK = SAFE_RANGE, QWERTY, FNM, NUM, MDIA };


**** COMMENT python-version

C-c C-c in code block to update

#+NAME: python-version
#+BEGIN_SRC python :tangle no
import sys
return sys.version
#+END_SRC

#+RESULTS: python-version
: 3.10.2 (main, Jan 15 2022, 19:56:27) [GCC 11.1.0]


**** Tap dancing
:PROPERTIES:
:CREATED:  [2022-02-15 Tue 12:58]
:END:

#+NAME: tapdance
| QUOT_LAYR | TD_RESET | TD_SPC |

#+NAME: td-enums
#+BEGIN_SRC python :var layer_table=tapdance :var mods_table=mods :tangle no
mods_dict = dict.fromkeys(mods_table[0])
layers = [ ]
keycodes = [ ]
for layer_row in layer_table:
  for hold in layer_row:
    if hold not in mods_dict and isinstance(hold, str) and hold != '' and hold != 'U_NP' and hold != 'RESET' and hold not in layers:
      layers.append(hold)
results = 'enum { ' + ', '.join(layers) + ' };'
return results
#+END_SRC

#+RESULTS: td-enums
: enum { QUOT_LAYR, TD_RESET, TD_SPC };

#+NAME: td-setup
#+begin_src c :main no :noweb yes :padline no :tangle no
// Define a type for as many tap dance states as you need
typedef enum {
  TD_NONE,
  TD_UNKNOWN,
  TD_SINGLE_TAP,
  TD_SINGLE_HOLD,
  TD_DOUBLE_TAP
} td_state_t;

typedef struct {
  bool is_press_action;
  td_state_t state;

} td_tap_t;

<<td-enums()>>

  // Function associated with all tap dances
td_state_t cur_dance(qk_tap_dance_state_t *state);

// Functions associated with individual tap dances
void ql_finished(qk_tap_dance_state_t *state, void *user_data);
void ql_reset(qk_tap_dance_state_t *state, void *user_data);

<<aliases-def()>>


const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {
  [_COLEMAK] = LAYOUT(
                      <<table-layout(alphas_table=colemakdh, mods_l_table=mods-l, mods_r_table=mods-r, bottom_table=bottomrow, top_table=toprow, hold_table=hold)>>
                      ),
  
  [_QWERTY] = LAYOUT(
                      <<table-layout(alphas_table=qwerty, mods_l_table=mods-l, mods_r_table=mods-r, bottom_table=bottomrow, top_table=toprow , hold_table=hold, blank_val=trns)>>
                      ),

  [_FNM] = LAYOUT(
                      <<table-layout(alphas_table=fnm, mods_l_table=fnm-mods-l, mods_r_table=fnm-mods-r, bottom_table=fnm-bottomrow, top_table=fnm-toprow , hold_table=fn-hold, blank_val=trns)>>
                      ),

}
#+end_src


